# next() 函式 會返回 “迭代物件” 的下一個元素
#
# 如果有許多元素儲存在list、tuple中，想使用next() 函式 讀出這些元素，則需要使用 “iter()” 函式，將其轉換成可“迭代物件”
def main():
    data = [1 , 2 , 3 , 4 , 5]
    data = iter(data)

    print(next(data))
    print(next(data))

if __name__ == '__main__':
    main()

# ************************************************************************************************************

# 可在next() 函式中指定元素，該元素將成為預設值，如果使用next() 函式讀取迭代物件，讀取出空物件時，則會讀取出預設值
def main():
    data = [1, 2, 3, 4, 5]
    data = iter(data)

for _in range(10):
        print(next(data, 777))


if __name__ == '__main__':
    main()

# ************************************************************************************************************